{
  "en": {
    "studio": "Studio",
    "scenes": "Scenes",
    "control": "LightFX",
    "settings": "Settings",
    "help": "Help",
    "help_text1": "Further information can be found in the",
    "help_text2": "quick guide",
    "help_text3": "or from the studio staff.",
    "about": "About Luminous",
    "show": "Show",
    "notConnected": "Unable to connect to Luminous server.",
    "language": "Language",
    "view": "View",
    "fullscreen": "Full Screen",
    "exitFullscreen": "Exit Full Screen",
    "documentation": "Documentation",
    "editLights": "Edit Lights",
    "SaveCurrentConfiguration": "Save as Scene",
    "AddNewScene": "Add New Scene",
    "group": "Group",
    "noDevices": "No device selected.<br> Please choose at least one device to continue.",
    "effects": "Effects",
    "noSupport": "Effects are not supported by the selection.",
    "saveAsScene": "Save as Scene",
    "dd_settings": "Settings",
    "dd_lights": "Devices",
    "dd_help": "Help",
    "dd_about": "About",
    "dd_fullscreen": "Fullscreen",
    "dd_window": "Window",
    "set_title": "Settings",
    "set_admin": "Admin",
    "set_general": "General",
    "set_language": "Language",
    "set_view": "View",
    "set_overview": "Studio Overview",
    "set_error_match": "The new passwords do not match",
    "set_error_change": "An Error occurred while changing the password",
    "set_changed_successfully": "Password changed successfully",
    "set_currrent_wrong": "Current password is wrong",
    "set_current_pw": "Current password",
    "set_new_pw": "New password",
    "set_conew_pw": "Confirm new password",
    "set_ola": "Open OLA",
    "ls_title": "Device Preferences",
    "ls_addDevice": "Add Device",
    "ls_saveDevice": "Save Device",
    "ls_deleteDevice": "Remove Device",
    "ls_basicSettings": "Basic Settings",
    "ls_deviceName": "Device Name",
    "ls_universe": "Universe",
    "ls_deviceNumber": "Number",
    "ls_deviceType": "Type",
    "ls_device_rgb": "RGB",
    "ls_device_rgbw": "RGBW",
    "ls_device_spot": "Spotlight",
    "ls_start": "Start",
    "ls_range": "Range",
    "ls_newDevice": "New Device",
    "ls_dmxSettings": "DMX Settings",
    "Off": "Off",
    "testchart": "Testchart",
    "bb_lights": "Devices",
    "as_title": "Save Current Configuration as Scene",
    "as_checkbox": "Set as Default Scene",
    "as_note": "Note: Scene will not be saved permanently unless set as default and admin password is entered.",
    "as_save": "Save",
    "as_cancel": "Cancel",
    "ap_title": "Enter Admin Password",
    "ap_password": "Password",
    "ap_note": "Note: If you do not have the authorization for this, please contact a studio supervisor.",
    "ap_confirm": "Confirm",
    "ds_title": "Really Delete Scene?",
    "ds_note": "Note: This scene will also be deleted automatically when the system is restarted.",
    "ds_delete": "Delete",
    "change_password": "Change Password",
    "noConnection": "No connection to the server",
    "retryConnection": "Trying to establish connection...",
    "restartServer": "If no connection can be established, consider restarting the server.",
    "catchphrase": "Multi-client DMX light control app with MIDI support",
    "whats_new": "What's new?",
    "appearance": "Appearance",
    "set_theme": "Theme",
    "cl_righthand": "Reversed Studio UI",
    "rd_title": "Luminous Closed and Lights Turned Off",
    "rd_text": "Would you like to recover the last session or start a new one?",
    "rd_reset": "Reset",
    "rd_recover": "Recover",
    "q1": "What is Luminous?",
    "q2": "How can I set more precise fader values?",
    "q3": "How do I add new lamps?",
    "q4": "How can I use Luminous on a different device?",
    "q5": "Where can I control the individual DMX channels of a lamp?",
    "q6": "Unable to connect to the server. What can I do?",
    "q7": "A problem has occurred. What can I do?",
    "q8": "How do I turn off the system?",
    "a1": "Luminous is a multi-client DMX lighting control app with MIDI support. The project was developed during the project semester 2023 in the modules PAM and WEB, with the intention to create a modern and intuitive lighting control for the studio. The Flask server runs on a Raspberry Pi 4 and sends the DMX signals using the Open Lighting Architecture (OLA). The web-based application was written in ViteJS and communicates with the server via WebSockets. Tailored to this studio, Luminous still offers the modularity for flexible studio operations.",
    "a2": "The faders support the full resolution of 255 levels per DMX channel. However, for easier visualization, only a rounded percentage value is displayed. Admittedly, it can be difficult to set more precise values with the faders. To facilitate this, you can also enter the values directly. To do this, click on the percentage value and enter the desired value as a decimal. The value can also be controlled using the mouse wheel and arrow keys.",
    "a3": "To add new lamps, you need the admin password. Once you have it, you can add lights via the dropdown menu in the top left corner on the gear icon under the 'Lights' tab. Select 'New Device' there and enter the desired settings.\nEven without being able to add a lamp, you can still control the DMX channels in the extended fader view in the 'Studio' tab.",
    "a4": "Luminous is designed to control lights on multiple clients (devices) in the studio and could run on any web browser. However, this functionality is not yet released. If you are interested, please let us know through the studio personnel.",
    "a5": "The fader view in the 'Studio' tab only shows the brightness faders of the lamps. In 'LightFX', you can also set Bi-Color and RGB channels. Additional channels can be found in the extended fader view in 'Studio'.",
    "a6": "First, check if the PC is connected to the router. Then check if the server is running. If this is the case, try restarting the server.",
    "a7": "We are sorry. Most problems can be solved by restarting the server. As we are still working to improve the system, errors may occur. If you have found a mistake, please let us know via the problem ticket or through the studio personnel.",
    "a8": "To turn off the system, first close the app, which will switch off all the lights, and then shut down the PC. Afterward, the power strip can be turned off."
  },
  "de": {
    "studio": "Studio",
    "scenes": "Szenen",
    "control": "LightFX",
    "settings": "Einstellungen",
    "help": "Hilfe",
    "help_text1": "Weitere Informationen finden Sie in der",
    "help_text2": "Kurzanleitung",
    "help_text3": "oder bei den Mitarbeitenden des Studios.",
    "about": "Über Luminous",
    "show": "Show",
    "notConnected": "Es konnte keine Verbindung zum Luminous Server hergestellt werden.",
    "language": "Sprache",
    "view": "Ansicht",
    "fullscreen": "Vollbild",
    "exitFullscreen": "Vollbild beenden",
    "documentation": "Dokumentation",
    "editLights": "Lichter bearbeiten",
    "SaveCurrentConfiguration": "Szene speichern",
    "AddNewScene": "Neue Szene hinzufügen",
    "group": "Gruppe",
    "noDevices": "Kein Gerät ausgewählt.<br> Bitte wählen Sie mindestens ein Gerät aus, um fortzufahren.",
    "effects": "Effekte",
    "noSupport": "Effekte werden von der Auswahl nicht unterstützt.",
    "saveAsScene": "Als Szene speichern",
    "dd_settings": "Einstellungen",
    "dd_lights": "Geräte",
    "dd_help": "Hilfe",
    "dd_about": "Über Luminous",
    "dd_fullscreen": "Vollbild",
    "dd_window": "Fenster",
    "set_title": "Einstellungen",
    "set_admin": "Administrator",
    "set_general": "Allgemein",
    "set_language": "Sprache",
    "set_view": "Ansicht",
    "set_overview": "Studio Übersicht",
    "set_error_match": "Die neuen Passwörter stimmen nicht überein",
    "set_error_change": "Ein Fehler ist aufgetreten",
    "set_changed_successfully": "Passwort erfolgreich geändert",
    "set_currrent_wrong": "Aktuelles Passwort ist falsch",
    "set_current_pw": "Aktuelles Passwort",
    "set_new_pw": "Neues Passwort",
    "set_conew_pw": "Neues Passwort bestätigen",
    "set_ola": "OLA öffnen",
    "ls_title": "Geräteverwaltung",
    "ls_addDevice": "Gerät hinzufügen",
    "ls_saveDevice": "Gerät speichern",
    "ls_deleteDevice": "Gerät entfernen",
    "ls_newDevice": "Neues Gerät",
    "ls_dmxSettings": "DMX Einstellungen",
    "ls_basicSettings": "Grundeinstellungen",
    "ls_universe": "Universum",
    "ls_deviceName": "Gerätename",
    "ls_deviceNumber": "Nummer",
    "ls_deviceType": "Typ",
    "ls_device_rgb": "RGB",
    "ls_device_rgbw": "RGBW",
    "ls_device_spot": "Spotlight",
    "ls_start": "Startkanal",
    "ls_range": "Kanalbereich",
    "Off": "Aus",
    "testchart": "Testchart",
    "bb_lights": "Geräte",
    "as_title": "Aktuelle Konfiguration als Szene speichern",
    "as_checkbox": "Als Standard Szene setzen",
    "as_note": "Hinweis: Standard-Setzung und Admin-Passworteingabe erforderlich, um Szene dauerhaft zu speichern.",
    "as_save": "Speichern",
    "as_cancel": "Abbrechen",
    "ap_title": "Administrator Passwort eingeben",
    "ap_password": "Passwort",
    "ap_note": "Hinweis: Wenn Sie nicht die Berechtigung dafür haben, wenden Sie sich bitte ans Studiopersonal.",
    "ap_confirm": "Bestätigen",
    "ds_title": "Szene wirklich löschen?",
    "ds_note": "Hinweis: Diese Szene wird auch automatisch gelöscht, wenn das System neu gestartet wird.",
    "ds_delete": "Löschen",
    "change_password": "Passwort ändern",
    "noConnection": "Keine Verbindung zum Server",
    "retryConnection": "Versuche Verbindung herzustellen...",
    "restartServer": "Wenn keine Verbindung hergestellt werden kann, versuchen Sie den Server neu zu starten.",
    "catchphrase": "Multi-Client DMX Lichtsteuerungs-App mit MIDI Unterstützung",
    "whats_new": "Was ist neu?",
    "appearance": "Erscheinungsbild",
    "set_theme": "Thema",
    "cl_righthand": "Umgedrehte Studio UI",
    "rd_title": "Luminous geschlossen und Lichter ausgeschaltet",
    "rd_text": "Möchten Sie Ihre letzte Sitzung wiederherstellen oder eine neue beginnen?",
    "rd_reset": "Zurücksetzen",
    "rd_recover": "Wiederherstellen",
    "q1": "Was ist Luminous?",
    "q2": "Wie kann ich genauere Faderwerte einstellen?",
    "q3": "Wie füge ich neue Lampen hinzu?",
    "q4": "Wie kann ich Luminous auf einem anderen Gerät verwenden?",
    "q5": "Wo kann ich die einzelnen DMX-Kanäle einer Lampe steuern?",
    "q6": "Es kann keine Verbindung zum Server hergestellt werden. Was kann ich tun?",
    "q7": "Ein Problem ist aufgetreten. Was kann ich tun?",
    "q8": "Wie schalte ich das System aus?",
    "a1": "Luminous ist eine Multi-Client DMX Lichtsteuerungs-App mit MIDI Unterstützung. \nDas Projekt entstand im Projektsemester 2023 in den Modulen PAM und WEB, mit der Intention, eine moderne und intuitive Lichtsteuerung für das Studio zu entwickeln. Der Flask-Server läuft auf einem Raspberry Pi 4 und sendet die DMX-Signale mit Hilfe der Open Lighting Architecture (OLA) die DMX-Signale. Die webbasierte Anwendung wurde in ViteJS geschrieben und kommuniziert mit dem Server über WebSockets. \nLuminous ist auf dieses Studio zugeschnitten, bietet aber trotzdem die Modularität für den flexiblen Studioalltag.",
    "a2": "Die Fader unterstützen die volle Auflösung von 255 Stufen pro DMX-Kanal. Zur einfacheren Visualisierung wird jedoch nur ein gerundeter Prozentwert angezeigt. Zugegebenermaßen kann es schwierig sein, genauere Werte mit den Fadern einzustellen. Um dies zu erleichtern, können Sie die Werte auch direkt eingeben. Klicken Sie dazu auf den Prozentwert und geben Sie den gewünschten Wert als Dezimalzahl ein. Zudem kann der Wert mit dem Mausrad und den Pfeiltasten gesteuert werden.",
    "a3": "Um neue Lampen hinzuzufügen, benötigt man das Admin-Passwort. Wenn man dieses hat, kann man sie über das Drop-Down-Menü oben links auf dem Zahnradsymbol auf dem Reiter \"Lichter\" hinzufügen. Wählen Sie dort \"Neues Gerät\" aus und geben Sie die gewünschten Einstellungen ein.\nOhne eine Lampe hinzufügen zu können, können Sie trotzdem die DMX-Kanäle in der erweiterten Faderansicht im Reiter \"Studio\" steuern.",
    "a4": "Luminous wurde entwickelt, um Licht auf mehreren Clients (Geräten) im Studio zu steuern und könnte über jeden Webbrowser laufen. Diese Funktionalität ist jedoch noch nicht freigegeben. Wenn Interesse daran besteht, ist es am besten uns über das Studiopersonal zu informieren.",
    "a5": "Die Faderansicht im Tab \"Studio\" zeigt nur die Helligkeitsfader der Lampen an. Im \"LightFX\" können zusätzlich Bi-Color und RGB Channel eingestellt werden. Weitere Kanäle sind in der erweiterten Faderansicht im \"Studio\" zu finden.",
    "a6": "Prüfen Sie zunächst, ob der PC mit dem Router verbunden ist. Prüfen Sie dann, ob der Server läuft. Sollte dies der Fall sein, versuchen Sie den Server neu zu starten.",
    "a7": "Das tut uns leid. Die meisten Probleme können durch einen Neustart des Servers behoben werden. Da wir noch an der Verbesserung des Systems arbeiten, können Fehler auftreten. Wenn Sie einen Fehler gefunden haben, informieren Sie uns bitte über den Problembericht oder über das Studiopersonal.",
    "a8": "Zum Ausschalten wird zuerst die App geschlossen, was alle Lichter ausschaltet, dann der PC heruntergefahren. Danach kann die Steckdosenleiste ausgeschaltet werden."
  }
}
